In [1]:
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

# PANDAS PRACTICE NOTEBOOK

Welcome to this pandas practice notebook! You will load two datasets that are commonly used for educational purposes, one about the passengers of the titanic (yay!) and one about plant characteristics. Follow the instructions! You might have to google something, and that is completely fine and part of the process:) enjoy!

### 1 - Basic data manipulation and cleaning

Load the titanic dataset

In [4]:
data = sns.load_dataset('titanic')

In [5]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

- How do you change the index of a DataFrame? Demonstrate this by setting the 'embark_town' column as the new index. Then change it back to a numerical index.

- Identify and handle missing values in the dataset. Use both the deletion method - when the data type is categorical - and the imputation method - when the data is numerical.

- Filter the rows of the DataFrame to only include rows where the passenger age value is greater than 26.

- Now filter the rows so that passengers are older than 86, female, and survived the shipwreck.

- Group data by one column (sex) and calculate the mean of another column per group (pclass). Check out the use of 'groupby'!

- Look at these two new dataframes, about student exams. Perform a merging operation between the two DataFrames on a the common 'Student ID' column.

In [ ]:
# Example DataFrames
students = pd.DataFrame({
    'Student ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

grades = pd.DataFrame({
    'Student ID': [2, 1, 3],
    'Grade': ['A', 'B', 'A-']
})

### 2 - Basic data analysis and plotting

- Now upload a new dataset, iris. This is a biology dataset with plant characteristics:

In [ ]:
data = sns.load_dataset('iris')

- Create a scatterplot of the two variables petal_length and petal_width.

In [ ]:


...

plt.tight_layout()

- Create a boxplot of petal_width with respect to the species of the plant.

- Make histogram of petal_width

- Based on these plots, it looks like plant features correlate highly with each other! Calculate correlations within the dataset.

- Describe the dataset (mean, sum, count, quartiles of the variables, etc)